02 Software/01 Broncode/operatiebrp-code-145.3/brp/test/brp-test-funqmachine/src/test/resources/xml/archivering-resultaat.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <DATA>
            Deze tekst dient gefilterd te worden.
            <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body>
            <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>034401</brp:ontvangendePartij>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Mutatiebericht</brp:soortSynchronisatie>
    <brp:abonnementNaam>Geen pop.bep. levering op basis van doelbinding</brp:abonnementNaam>
    <brp:categorieDienst>Mutatielevering op basis van doelbinding</brp:categorieDienst>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling" brp:verwerkingssoort="Toevoeging">
    <brp:code>01002</brp:code>
    <brp:naam>Geboorte in Nederland met erkenning</brp:naam>
    <brp:categorie>Actualisering</brp:categorie>
    <brp:partijCode>017401</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>


        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>


        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1922-04-19</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>800068464</brp:burgerservicenummer>
          <brp:administratienummer>8080141812</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1922-04-19</brp:datumAanvangGeldigheid>
          <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Tanja</brp:voornamen>
          <brp:voorvoegsel>de</brp:voorvoegsel>
          <brp:scheidingsteken> </brp:scheidingsteken>
          <brp:geslachtsnaamstam>Vlonder</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>1922-04-19</brp:datum>
          <brp:gemeenteCode>1236</brp:gemeenteCode>
          <brp:woonplaatsnaam>Ouwerkerk</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1922-04-19</brp:datumAanvangGeldigheid>
          <brp:code>V</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:ouder brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:verwerkingssoort="Toevoeging">
              <brp:betrokkenheden>
                <brp:kind brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging">
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Toevoeging">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>800068750</brp:burgerservicenummer>
                      <brp:administratienummer>8090962370</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Piet Hein</brp:voornamen>
                      <brp:voorvoegsel>de</brp:voorvoegsel>
                      <brp:scheidingsteken> </brp:scheidingsteken>
                      <brp:geslachtsnaamstam>Vlonder</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>[vandaag(0,0,0)]</brp:datum>
                      <brp:gemeenteCode>1773</brp:gemeenteCode>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:kind>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:ouder>
        </brp:betrokkenheden>
      </brp:persoon>
      <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Wijziging" brp:communicatieID="*">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Toevoeging">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>


        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:verwerkingssoort="Verval">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>


        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1992-02-19</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>800004656</brp:burgerservicenummer>
          <brp:administratienummer>8050564295</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1992-02-19</brp:datumAanvangGeldigheid>
          <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Berend</brp:voornamen>
          <brp:voorvoegsel>de</brp:voorvoegsel>
          <brp:scheidingsteken> </brp:scheidingsteken>
          <brp:geslachtsnaamstam>Zatte</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datum>1992-02-19</brp:datum>
          <brp:gemeenteCode>0974</brp:gemeenteCode>
          <brp:woonplaatsnaam>Koningsbosch</brp:woonplaatsnaam>
          <brp:landGebiedCode>6030</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:verwerkingssoort="Identificatie">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:datumAanvangGeldigheid>1992-02-19</brp:datumAanvangGeldigheid>
          <brp:code>M</brp:code>
        </brp:geslachtsaanduiding>
        <brp:betrokkenheden>
          <brp:ouder brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging">
            <brp:familierechtelijkeBetrekking brp:objecttype="Relatie" brp:verwerkingssoort="Toevoeging">
              <brp:betrokkenheden>
                <brp:kind brp:objecttype="Betrokkenheid" brp:verwerkingssoort="Toevoeging">
                  <brp:persoon brp:objecttype="Persoon" brp:verwerkingssoort="Toevoeging">
                    <brp:soortCode>I</brp:soortCode>
                    <brp:identificatienummers brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:burgerservicenummer>800068750</brp:burgerservicenummer>
                      <brp:administratienummer>8090962370</brp:administratienummer>
                    </brp:identificatienummers>
                    <brp:samengesteldeNaam brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:indicatieAfgeleid>J</brp:indicatieAfgeleid>
                      <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
                      <brp:voornamen>Piet Hein</brp:voornamen>
                      <brp:voorvoegsel>de</brp:voorvoegsel>
                      <brp:scheidingsteken> </brp:scheidingsteken>
                      <brp:geslachtsnaamstam>Vlonder</brp:geslachtsnaamstam>
                    </brp:samengesteldeNaam>
                    <brp:geboorte brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datum>[vandaag(0,0,0)]</brp:datum>
                      <brp:gemeenteCode>1773</brp:gemeenteCode>
                      <brp:landGebiedCode>6030</brp:landGebiedCode>
                    </brp:geboorte>
                    <brp:geslachtsaanduiding brp:verwerkingssoort="Toevoeging">
                      <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                      <brp:datumAanvangGeldigheid>[vandaag(0,0,0)]</brp:datumAanvangGeldigheid>
                      <brp:code>M</brp:code>
                    </brp:geslachtsaanduiding>
                  </brp:persoon>
                </brp:kind>
              </brp:betrokkenheden>
            </brp:familierechtelijkeBetrekking>
          </brp:ouder>
        </brp:betrokkenheden>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon></soap:Body></soap:Header/></soap:Envelope></DATA>
            <ONTVANGENDEPARTIJCODE>34401</ONTVANGENDEPARTIJCODE>
        </Row>
    </ResultSet>
</Results>
